# StairSetWFlight1M

## Description
Sets width of stair - not recommended for use as stair might end up with inconsistent and contradictory parameters.

```pascal
FUNCTION StairSetWFlight1M(
				stair              : HANDLE;
				WidthOfFirstFlight : REAL): BOOLEAN;
```

```python
def vs.StairSetWFlight1M(stair, WidthOfFirstFlight):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|stair|HANDLE|   |
|WidthOfFirstFlight|REAL|   |

## Version
Availability: from Vectorworks 2021

## Category
* Objects - Stairs